HirokiIshiguro/iot-reference-rx/Projects/aws_wifi_rx671_ek/e2studio_ccrx/src/whd_port/cyhal_sdhc.c
/*
 * cyhal_sdhc - WHD SDIO bus backend (cyhal_sdio) for the EK-RX671 / Type 1YN.
 *
 * Implements the cyhal_sdio contract WHD's whd_bus_sdio driver calls, on top of
 * the project's proven polled SDHI host (sdio_host.c / r_sdio_rx). WHD owns
 * everything above the raw transport: it programs F1 enable, the Broadcom
 * backplane window, the firmware download and the SDPCM/scan flow itself through
 * cyhal_sdio_send_cmd (CMD52) and cyhal_sdio_bulk_transfer (CMD53). So this file
 * is a thin shim - the heavy lifting was de-risked in increments 4a-4c.
 *
 * The host data path is synchronous today. WHD receives SDPCM control/event
 * traffic by having the SDHI SDIO card interrupt (SDACI / IOIRQ from DAT1)
 * wake the WHD thread; the legacy FreeRTOS-timer soft IRQ remains as a bring-up
 * fallback when WHD_SDIO_USE_SDHI_IRQ is disabled.
 */
#include <stdint.h>
#include <stdbool.h>
#include <stddef.h>

#include "whd.h"
#include "cy_result.h"
#include "cyhal_sdio.h"
#include "cyhal_gpio.h"

#include "FreeRTOS.h"
#include "task.h"
#include "timers.h"

#include "debug_uart.h"
#include "r_sdhi_rx_if.h"
#include "sdio_host.h"
#include "whd_join_config.h"
#include "whd_port.h"

#define SDIOD_CCCR_INTPEND              (0x05U)
#define INTR_STATUS_FUNC1               (0x02U)
#define INTR_STATUS_FUNC2               (0x04U)
#define SDIO_SDHI_IRQ_TASK_STACK_WORDS  (1024U)
#define SDIO_SDHI_IRQ_TASK_PRIORITY     (tskIDLE_PRIORITY + 3U)
#define SDIO_DEBUG_TRACE_DEPTH          (32U)
#define SDIO_DEBUG_TRACE_MASK           (SDIO_DEBUG_TRACE_DEPTH - 1U)
#define SDIO_DEBUG_TRACE_CMD52          (52U)
#define SDIO_DEBUG_TRACE_CMD53          (53U)

static cyhal_sdio_irq_handler_t g_sdio_irq_handler;
static void * g_sdio_irq_handler_arg;
static TimerHandle_t g_sdio_softirq_timer;
static TaskHandle_t g_sdio_sdhi_irq_task;
static volatile bool g_sdio_softirq_enabled;
static volatile bool g_sdio_sdhi_irq_enabled;
static volatile bool g_sdio_sdhi_irq_latched;
static uint32_t g_cmd52_fail_log_count;
static uint32_t g_cmd53_fail_log_count;
static bool g_pre_cmd53_clocks_ready;
static volatile bool g_sdio_bus_busy;

volatile uint32_t g_whd_sdio_sdhi_irq_count;
volatile uint32_t g_whd_sdio_sdhi_irq_ignored_count;
volatile uint32_t g_whd_sdio_sdhi_irq_rearm_count;
volatile uint32_t g_whd_sdio_sdhi_irq_last_status;
volatile uint32_t g_whd_sdio_sdhi_irq_notify_count;
volatile uint32_t g_whd_sdio_sdhi_irq_task_count;
volatile uint32_t g_whd_sdio_softirq_notify_count;
volatile uint32_t g_whd_sdio_softirq_pending_count;
volatile uint32_t g_whd_sdio_irq_task_state;
volatile uint32_t g_whd_sdio_irq_handler_enter_count;
volatile uint32_t g_whd_sdio_irq_handler_exit_count;
volatile uint32_t g_whd_sdio_irq_handler_ptr_last;
volatile uint32_t g_whd_sdio_irq_handler_arg_last;
volatile uint32_t g_whd_sdio_irq_handler_event_last;
volatile uint32_t g_whd_sdio_cmd52_enter_count;
volatile uint32_t g_whd_sdio_cmd52_exit_count;
volatile uint32_t g_whd_sdio_cmd52_fail_count;
volatile uint32_t g_whd_sdio_cmd52_last_write;
volatile uint32_t g_whd_sdio_cmd52_last_function;
volatile uint32_t g_whd_sdio_cmd52_last_address;
volatile uint32_t g_whd_sdio_cmd52_last_io;
volatile uint32_t g_whd_sdio_cmd52_last_ok;
volatile uint32_t g_whd_sdio_cmd52_fail_last_s1;
volatile uint32_t g_whd_sdio_cmd52_fail_last_s2;
volatile uint32_t g_whd_sdio_cmd53_enter_count;
volatile uint32_t g_whd_sdio_cmd53_exit_count;
volatile uint32_t g_whd_sdio_cmd53_fail_count;
volatile uint32_t g_whd_sdio_cmd53_last_write;
volatile uint32_t g_whd_sdio_cmd53_last_function;
volatile uint32_t g_whd_sdio_cmd53_last_address;
volatile uint32_t g_whd_sdio_cmd53_last_increment;
volatile uint32_t g_whd_sdio_cmd53_last_block_mode;
volatile uint32_t g_whd_sdio_cmd53_last_count;
volatile uint32_t g_whd_sdio_cmd53_last_length;
volatile uint32_t g_whd_sdio_cmd53_last_data_ptr;
volatile uint32_t g_whd_sdio_cmd53_last_wait_count;
volatile uint32_t g_whd_sdio_cmd53_last_r5;
volatile uint32_t g_whd_sdio_cmd53_last_ok;
volatile uint32_t g_whd_sdio_cmd53_last_result;
volatile uint32_t g_whd_sdio_cmd53_last_data0;
volatile uint32_t g_whd_sdio_cmd53_fail_last_stage;
volatile uint32_t g_whd_sdio_cmd53_fail_last_s1;
volatile uint32_t g_whd_sdio_cmd53_fail_last_s2;
volatile uint32_t g_whd_sdio_cmd53_fail_last_er1;
volatile uint32_t g_whd_sdio_cmd53_fail_last_er2;
volatile uint32_t g_whd_sdio_cmd53_fail_last_diag_r5;
volatile uint32_t g_whd_sdio_cmd53_fail_last_data0;
volatile uint32_t g_whd_sdio_cmd53_f2_write_enter_count;
volatile uint32_t g_whd_sdio_cmd53_f2_write_ok_count;
volatile uint32_t g_whd_sdio_cmd53_f2_write_fail_count;
volatile uint32_t g_whd_sdio_cmd53_f2_write_byte_count;
volatile uint32_t g_whd_sdio_cmd53_f2_write_block_count;
volatile uint32_t g_whd_sdio_cmd53_f2_write_last_address;
volatile uint32_t g_whd_sdio_cmd53_f2_write_last_increment;
volatile uint32_t g_whd_sdio_cmd53_f2_write_last_block_mode;
volatile uint32_t g_whd_sdio_cmd53_f2_write_last_count;
volatile uint32_t g_whd_sdio_cmd53_f2_write_last_length;
volatile uint32_t g_whd_sdio_cmd53_f2_write_last_r5;
volatile uint32_t g_whd_sdio_cmd53_f2_write_last_result;
volatile uint32_t g_whd_sdio_cmd53_f2_write_last_data0;
volatile uint32_t g_whd_sdio_cmd53_f2_read_enter_count;
volatile uint32_t g_whd_sdio_cmd53_f2_read_ok_count;
volatile uint32_t g_whd_sdio_cmd53_f2_read_fail_count;
volatile uint32_t g_whd_sdio_cmd53_f2_read_byte_count;
volatile uint32_t g_whd_sdio_cmd53_f2_read_block_count;
volatile uint32_t g_whd_sdio_cmd53_f2_read_last_address;
volatile uint32_t g_whd_sdio_cmd53_f2_read_last_increment;
volatile uint32_t g_whd_sdio_cmd53_f2_read_last_block_mode;
volatile uint32_t g_whd_sdio_cmd53_f2_read_last_count;
volatile uint32_t g_whd_sdio_cmd53_f2_read_last_length;
volatile uint32_t g_whd_sdio_cmd53_f2_read_last_r5;
volatile uint32_t g_whd_sdio_cmd53_f2_read_last_result;
volatile uint32_t g_whd_sdio_cmd53_f2_read_last_data0;
volatile uint32_t g_whd_sdio_debug_break_count;
volatile uint32_t g_whd_sdio_debug_break_reason;
volatile uint32_t g_whd_sdio_trace_index;
volatile uint32_t g_whd_sdio_trace_frozen;
volatile uint32_t g_whd_sdio_trace[SDIO_DEBUG_TRACE_DEPTH][9];

void whd_sdio_debug_break_hook(uint32_t reason)
{
    g_whd_sdio_debug_break_reason = reason;
    g_whd_sdio_debug_break_count++;
}

static void sdio_debug_trace(uint32_t kind, uint32_t write, uint32_t function,
                             uint32_t address, uint32_t count_or_value,
                             uint32_t length_or_io, uint32_t r5,
                             uint32_t result, uint32_t data0)
{
    uint32_t slot = g_whd_sdio_trace_index & SDIO_DEBUG_TRACE_MASK;

    if (0U != g_whd_sdio_trace_frozen)
    {
        return;
    }

    g_whd_sdio_trace[slot][0] = kind;
    g_whd_sdio_trace[slot][1] = write;
    g_whd_sdio_trace[slot][2] = function;
    g_whd_sdio_trace[slot][3] = address;
    g_whd_sdio_trace[slot][4] = count_or_value;
    g_whd_sdio_trace[slot][5] = length_or_io;
    g_whd_sdio_trace[slot][6] = r5;
    g_whd_sdio_trace[slot][7] = result;
    g_whd_sdio_trace[slot][8] = data0;
    g_whd_sdio_trace_index++;
}

static uint32_t sdio_debug_data0(const uint32_t * data, uint32_t length)
{
    const uint8_t * p = (const uint8_t *)(const void *)data;

