HirokiIshiguro/iot-reference-rx/Projects/aws_wifi_rx671_ek/e2studio_ccrx/src/whd_port/cyhal_sdhc.c
    if ((NULL == p) || (length < 4U))
    {
        return 0U;
    }

    return ((uint32_t)p[0]) |
           ((uint32_t)p[1] << 8) |
           ((uint32_t)p[2] << 16) |
           ((uint32_t)p[3] << 24);
}

static void sdio_diag_cmd53_f2_enter(bool write, uint32_t address, bool increment,
                                     bool block_mode, uint32_t count, uint32_t length)
{
    if (write)
    {
        g_whd_sdio_cmd53_f2_write_enter_count++;
        g_whd_sdio_cmd53_f2_write_last_address = address;
        g_whd_sdio_cmd53_f2_write_last_increment = increment ? 1U : 0U;
        g_whd_sdio_cmd53_f2_write_last_block_mode = block_mode ? 1U : 0U;
        g_whd_sdio_cmd53_f2_write_last_count = count;
        g_whd_sdio_cmd53_f2_write_last_length = length;
    }
    else
    {
        g_whd_sdio_cmd53_f2_read_enter_count++;
        g_whd_sdio_cmd53_f2_read_last_address = address;
        g_whd_sdio_cmd53_f2_read_last_increment = increment ? 1U : 0U;
        g_whd_sdio_cmd53_f2_read_last_block_mode = block_mode ? 1U : 0U;
        g_whd_sdio_cmd53_f2_read_last_count = count;
        g_whd_sdio_cmd53_f2_read_last_length = length;
    }
}

static void sdio_diag_cmd53_f2_exit(bool write, bool ok, bool block_mode, uint32_t count,
                                    uint32_t length, uint32_t r5, uint32_t result, uint32_t data0)
{
    if (write)
    {
        g_whd_sdio_cmd53_f2_write_last_r5 = r5;
        g_whd_sdio_cmd53_f2_write_last_result = result;
        g_whd_sdio_cmd53_f2_write_last_data0 = data0;
        if (ok)
        {
            g_whd_sdio_cmd53_f2_write_ok_count++;
            g_whd_sdio_cmd53_f2_write_byte_count += length;
            if (block_mode)
            {
                g_whd_sdio_cmd53_f2_write_block_count += count;
            }
        }
        else
        {
            g_whd_sdio_cmd53_f2_write_fail_count++;
        }
    }
    else
    {
        g_whd_sdio_cmd53_f2_read_last_r5 = r5;
        g_whd_sdio_cmd53_f2_read_last_result = result;
        g_whd_sdio_cmd53_f2_read_last_data0 = data0;
        if (ok)
        {
            g_whd_sdio_cmd53_f2_read_ok_count++;
            g_whd_sdio_cmd53_f2_read_byte_count += length;
            if (block_mode)
            {
                g_whd_sdio_cmd53_f2_read_block_count += count;
            }
        }
        else
        {
            g_whd_sdio_cmd53_f2_read_fail_count++;
        }
    }
}

static bool sdio_try_begin_bus(void)
{
    bool acquired = false;

    taskENTER_CRITICAL();
    if (!g_sdio_bus_busy)
    {
        g_sdio_bus_busy = true;
        acquired = true;
    }
    taskEXIT_CRITICAL();

    return acquired;
}

static void sdio_end_bus(void)
{
    taskENTER_CRITICAL();
    g_sdio_bus_busy = false;
    taskEXIT_CRITICAL();
}

static uint32_t sdio_begin_bus_blocking(void)
{
    uint32_t wait_count = 0U;

    while (!sdio_try_begin_bus())
    {
        wait_count++;
        taskYIELD();
    }

    return wait_count;
}

static TickType_t sdio_softirq_period_ticks(void)
{
    TickType_t ticks = pdMS_TO_TICKS(WHD_SDIO_SOFTIRQ_POLL_MS);

    if (0U == WHD_SDIO_SOFTIRQ_POLL_MS)
    {
        return 0U;
    }
    return (0U == ticks) ? 1U : ticks;
}

static void sdio_softirq_timer_callback(TimerHandle_t xTimer)
{
#if !WHD_SDIO_SOFTIRQ_ALWAYS_NOTIFY
    uint8_t pending = 0U;
#endif

    (void)xTimer;

    if (!g_sdio_softirq_enabled || (NULL == g_sdio_irq_handler))
    {
        return;
    }
#if !WHD_SDIO_SOFTIRQ_ALWAYS_NOTIFY
    if (!sdio_try_begin_bus())
    {
        return;
    }
    if (!sdio_host_cmd52_read(0U, SDIOD_CCCR_INTPEND, &pending))
    {
        sdio_end_bus();
        return;
    }
    sdio_end_bus();

    if (0U == (pending & (INTR_STATUS_FUNC1 | INTR_STATUS_FUNC2)))
    {
        return;
    }
    g_whd_sdio_softirq_pending_count++;
#endif

    g_whd_sdio_softirq_notify_count++;
    whd_port_rtos_set_thread_context_irq(true);
    g_sdio_irq_handler(g_sdio_irq_handler_arg, CYHAL_SDIO_CARD_INTERRUPT);
    whd_port_rtos_set_thread_context_irq(false);
}

static void sdio_softirq_enable(bool enable)
{
    if (0U == WHD_SDIO_SOFTIRQ_POLL_MS)
    {
        g_sdio_softirq_enabled = false;
        return;
    }

    if (NULL == g_sdio_softirq_timer)
    {
        g_sdio_softirq_timer = xTimerCreate("whd_sdio_irq", sdio_softirq_period_ticks(), pdTRUE,
                                            NULL, sdio_softirq_timer_callback);
    }

    if (NULL == g_sdio_softirq_timer)
    {
        g_sdio_softirq_enabled = false;
        return;
    }

    g_sdio_softirq_enabled = enable;
    if (enable)
    {
        (void)xTimerStart(g_sdio_softirq_timer, 0U);
    }
    else
    {
        (void)xTimerStop(g_sdio_softirq_timer, 0U);
    }
}

static sdhi_status_t sdio_sdhi_irq_callback(uint32_t sdiosts)
{
    BaseType_t higher_priority_task_woken = pdFALSE;

    g_whd_sdio_sdhi_irq_last_status = sdiosts;

    if (0U == (sdiosts & SDHI_SDIOSTS_IOIRQ))
    {
        g_whd_sdio_sdhi_irq_ignored_count++;
        return SDHI_SUCCESS;
    }

    g_whd_sdio_sdhi_irq_count++;
    g_sdio_sdhi_irq_latched = true;

    /* IOIRQ is level-like from the WLAN function's point of view. Mask it until
     * the awakened WHD thread has had a chance to drain the SDPCM interrupt
     * source; otherwise the SDHI group interrupt can immediately retrigger. */
    (void)R_SDHI_ClearSdioIntMask(SDHI_CH0, SDHI_SDIOIMSK_IOIRQ);
    (void)R_SDHI_ClearSdiostsReg(SDHI_CH0, SDHI_SDIOSTS_IOIRQ);

    if (g_sdio_sdhi_irq_enabled && (NULL != g_sdio_sdhi_irq_task))
    {
        g_whd_sdio_sdhi_irq_notify_count++;
        vTaskNotifyGiveFromISR(g_sdio_sdhi_irq_task, &higher_priority_task_woken);
        portYIELD_FROM_ISR(higher_priority_task_woken);
    }
    else
    {
        g_whd_sdio_sdhi_irq_ignored_count++;
    }

    return SDHI_SUCCESS;
}

static void sdio_sdhi_irq_task(void * pvParameters)
{
    (void)pvParameters;

    for (;;)
    {
        g_whd_sdio_irq_task_state = 1U;
        (void)ulTaskNotifyTake(pdTRUE, portMAX_DELAY);
        g_whd_sdio_irq_task_state = 2U;
        g_whd_sdio_sdhi_irq_task_count++;

        if (g_sdio_sdhi_irq_enabled && (NULL != g_sdio_irq_handler))
        {
            g_whd_sdio_irq_task_state = 3U;
            g_whd_sdio_irq_handler_ptr_last = (uint32_t)(uintptr_t)g_sdio_irq_handler;
            g_whd_sdio_irq_handler_arg_last = (uint32_t)(uintptr_t)g_sdio_irq_handler_arg;
            g_whd_sdio_irq_handler_event_last = (uint32_t)CYHAL_SDIO_CARD_INTERRUPT;
            g_whd_sdio_irq_handler_enter_count++;
            whd_port_rtos_set_thread_context_irq(true);
            g_sdio_irq_handler(g_sdio_irq_handler_arg, CYHAL_SDIO_CARD_INTERRUPT);
            whd_port_rtos_set_thread_context_irq(false);
            g_whd_sdio_irq_handler_exit_count++;
            g_whd_sdio_irq_task_state = 4U;
        }
        else
        {
            g_whd_sdio_sdhi_irq_ignored_count++;
            g_whd_sdio_irq_task_state = 5U;
        }

        /* Let the WHD worker run and drain the SDPCM interrupt source before
         * re-enabling the level-like DAT1/IOIRQ source in SDHI. */
        g_whd_sdio_irq_task_state = 6U;
        vTaskDelay(1U);

