HirokiIshiguro/iot-reference-rx/Projects/aws_wifi_rx671_ek/e2studio_ccrx/src/whd_port/cyhal_sdhc.c
        if (g_sdio_sdhi_irq_enabled && g_sdio_sdhi_irq_latched)
        {
            g_whd_sdio_irq_task_state = 7U;
            g_sdio_sdhi_irq_latched = false;
            (void)R_SDHI_ClearSdiostsReg(SDHI_CH0, SDHI_SDIOSTS_IOIRQ);
            (void)R_SDHI_SetSdioIntMask(SDHI_CH0, SDHI_SDIOIMSK_IOIRQ);
            g_whd_sdio_sdhi_irq_rearm_count++;
        }
        g_whd_sdio_irq_task_state = 8U;
    }
}

static void sdio_sdhi_irq_rearm_after_bus(void)
{
#if WHD_SDIO_USE_SDHI_IRQ
    if (g_sdio_sdhi_irq_enabled && g_sdio_sdhi_irq_latched)
    {
        g_sdio_sdhi_irq_latched = false;
        (void)R_SDHI_ClearSdiostsReg(SDHI_CH0, SDHI_SDIOSTS_IOIRQ);
        (void)R_SDHI_SetSdioIntMask(SDHI_CH0, SDHI_SDIOIMSK_IOIRQ);
        g_whd_sdio_sdhi_irq_rearm_count++;
    }
#endif
}

static void sdio_sdhi_irq_enable(bool enable)
{
#if WHD_SDIO_USE_SDHI_IRQ
    if (enable)
    {
        if (NULL == g_sdio_sdhi_irq_task)
        {
            (void)xTaskCreate(sdio_sdhi_irq_task, "sdio_irq",
                              SDIO_SDHI_IRQ_TASK_STACK_WORDS, NULL,
                              SDIO_SDHI_IRQ_TASK_PRIORITY, &g_sdio_sdhi_irq_task);
        }

        if (NULL == g_sdio_sdhi_irq_task)
        {
            g_sdio_sdhi_irq_enabled = false;
            return;
        }

        g_sdio_sdhi_irq_latched = false;
        g_sdio_sdhi_irq_enabled = true;
        (void)R_SDHI_IntSdioCallback(SDHI_CH0, sdio_sdhi_irq_callback);
        (void)R_SDHI_OutReg(SDHI_CH0, SDHI_SDIOMD, SDHI_SDIOMD_INTEN);
        (void)R_SDHI_ClearSdiostsReg(SDHI_CH0, SDHI_SDIOSTS_IOIRQ);
        (void)R_SDHI_SetSdioIntMask(SDHI_CH0, SDHI_SDIOIMSK_IOIRQ);
        (void)R_SDHI_EnableIcuInt(SDHI_CH0, SDHI_HWINT_ACCESS_CD);
    }
    else
    {
        g_sdio_sdhi_irq_enabled = false;
        g_sdio_sdhi_irq_latched = false;
        (void)R_SDHI_ClearSdioIntMask(SDHI_CH0, SDHI_SDIOIMSK_IOIRQ);
        (void)R_SDHI_DisableIcuInt(SDHI_CH0, SDHI_HWINT_ACCESS_CD);
        (void)R_SDHI_IntSdioCallback(SDHI_CH0, NULL);
    }
#else
    (void)enable;
#endif
}

static void sdio_log_cmd52_fail(bool write, uint8_t function, uint32_t address, uint8_t io, uint32_t r5)
{
    uint32_t s1 = 0U;
    uint32_t s2 = 0U;
    char line[160];
    char * p = line;

    g_whd_sdio_cmd52_fail_count++;
    if (g_cmd52_fail_log_count >= WHD_SDIO_DIAG_FAIL_LIMIT)
    {
        return;
    }
    g_cmd52_fail_log_count++;

    (void)R_SDHI_InReg(SDHI_CH0, SDHI_SDSTS1, &s1);
    (void)R_SDHI_InReg(SDHI_CH0, SDHI_SDSTS2, &s2);
    g_whd_sdio_cmd52_fail_last_s1 = s1;
    g_whd_sdio_cmd52_fail_last_s2 = s2;

    p = append_text(p, "sdio cmd52 NG dir=");
    p = append_text(p, write ? "W" : "R");
    p = append_text(p, " f=");
    p = append_dec32(p, function);
    p = append_text(p, " a=");
    p = append_hex32(p, address);
    p = append_text(p, " io=");
    p = append_hex8(p, io);
    p = append_text(p, " r5=");
    p = append_hex32(p, r5);
    p = append_text(p, " s1=");
    p = append_hex32(p, s1);
    p = append_text(p, " s2=");
    p = append_hex32(p, s2);
    p = append_text(p, "\r\n");
    *p = '\0';
    debug_puts(line);
}

static void sdio_log_cmd53_fail(bool write, uint8_t function, uint32_t address, bool increment,
                                bool block_mode, uint32_t count, uint32_t r5)
{
    uint8_t stage = 0U;
    uint32_t s1 = 0U;
    uint32_t s2 = 0U;
    uint32_t er1 = 0U;
    uint32_t er2 = 0U;
    uint32_t diag_r5 = 0U;
    uint32_t data0 = 0U;
    char line[240];
    char * p = line;

    g_whd_sdio_cmd53_fail_count++;
    if (g_cmd53_fail_log_count >= WHD_SDIO_DIAG_FAIL_LIMIT)
    {
        return;
    }
    g_cmd53_fail_log_count++;

    sdio_host_cmd53_diag_ext(&stage, &s1, &s2, &er1, &er2, &diag_r5, &data0);
    g_whd_sdio_cmd53_fail_last_stage = stage;
    g_whd_sdio_cmd53_fail_last_s1 = s1;
    g_whd_sdio_cmd53_fail_last_s2 = s2;
    g_whd_sdio_cmd53_fail_last_er1 = er1;
    g_whd_sdio_cmd53_fail_last_er2 = er2;
    g_whd_sdio_cmd53_fail_last_diag_r5 = diag_r5;
    g_whd_sdio_cmd53_fail_last_data0 = data0;

    p = append_text(p, "sdio cmd53 NG dir=");
    p = append_text(p, write ? "W" : "R");
    p = append_text(p, " f=");
    p = append_dec32(p, function);
    p = append_text(p, " a=");
    p = append_hex32(p, address);
    p = append_text(p, " inc=");
    p = append_dec32(p, increment ? 1U : 0U);
    p = append_text(p, " blk=");
    p = append_dec32(p, block_mode ? 1U : 0U);
    p = append_text(p, " cnt=");
    p = append_dec32(p, count);
    p = append_text(p, " r5=");
    p = append_hex32(p, r5);
    p = append_text(p, " st=");
    p = append_dec32(p, stage);
    p = append_text(p, " s1=");
    p = append_hex32(p, s1);
    p = append_text(p, " s2=");
    p = append_hex32(p, s2);
    p = append_text(p, " er1=");
    p = append_hex32(p, er1);
    p = append_text(p, " er2=");
    p = append_hex32(p, er2);
    p = append_text(p, " dr5=");
    p = append_hex32(p, diag_r5);
    p = append_text(p, " d0=");
    p = append_hex32(p, data0);
    p = append_text(p, "\r\n");
    *p = '\0';
    debug_puts(line);
}

static bool sdio_prepare_pre_cmd53(uint8_t function)
{
#if WHD_SDIO_PRE_CMD53_CLOCKS
    uint8_t csr = 0U;
    uint8_t slp = 0U;
    bool ok;
    char line[96];
    char * p = line;

    if ((1U != function) || g_pre_cmd53_clocks_ready)
    {
        return true;
    }

    ok = sdio_host_brcm_force_clocks(&csr) && sdio_host_request_kso(&slp);
    p = append_text(p, ok ? "sdio pre-cmd53 ok csr=" : "sdio pre-cmd53 NG csr=");
    p = append_hex8(p, csr);
    p = append_text(p, " slp=");
    p = append_hex8(p, slp);
    p = append_text(p, "\r\n");
    *p = '\0';
    debug_puts(line);

    g_pre_cmd53_clocks_ready = ok;
    return ok;
#else
    (void)function;
    return true;
#endif
}

/* Bring up the SDHI host and enumerate the card into the transfer state
 * (CMD0/CMD5/CMD3/CMD7), then open the r_sdio_rx protocol layer over the CMD52
 * host. WHD drives F1 enable / bus width / backplane / firmware download after
 * this through send_cmd + bulk_transfer. The SDHI pins are fixed by the board
 * pin configuration (corrected PORTD map), so the pin arguments are ignored. */
cy_rslt_t cyhal_sdio_init(cyhal_sdio_t *obj, cyhal_gpio_t cmd, cyhal_gpio_t clk,
                          cyhal_gpio_t data0, cyhal_gpio_t data1,
                          cyhal_gpio_t data2, cyhal_gpio_t data3)
{
    uint32_t r4 = 0U;
    uint8_t func = 0U;
    uint16_t rca = 0U;

    (void)obj;
    (void)cmd;
    (void)clk;
    (void)data0;
    (void)data1;
    (void)data2;
    (void)data3;

