HirokiIshiguro/iot-reference-rx/Projects/aws_wifi_rx671_ek/e2studio_ccrx/src/whd_port/cyhal_sdhc.c
    if (!sdio_host_init())
    {
        return CYHAL_SDIO_RSLT_ERR_CLOCK;
    }
    if (!sdio_host_first_contact(&r4, &func))
    {
        return CYHAL_SDIO_RSLT_ERR_FUNC_RET(CYHAL_SDIO_RET_CMD_TIMEOUT);
    }
    if (!sdio_host_select_card(&rca))
    {
        return CYHAL_SDIO_RSLT_ERR_FUNC_RET(CYHAL_SDIO_RET_NO_SP_ERRORS);
    }
    if (!sdio_host_protocol_open())
    {
        return CYHAL_SDIO_RSLT_ERR_FUNC_RET(CYHAL_SDIO_RET_NO_SP_ERRORS);
    }
    return CY_RSLT_SUCCESS;
}

void cyhal_sdio_free(cyhal_sdio_t *obj)
{
    (void)obj;
}

/* Host-side bus configuration: 4-bit data and run clock - the proven
 * pre-data-phase setup. WHD programs function block sizes during its bus init,
 * and cyhal_sdio_send_cmd mirrors those writes into the host-side block-size
 * cache, so we do not pre-program block size here. */
cy_rslt_t cyhal_sdio_configure(cyhal_sdio_t *obj, const cyhal_sdio_cfg_t *config)
{
    (void)obj;

    if (NULL == config)
    {
        return CYHAL_SDIO_RSLT_ERR_BAD_PARAM;
    }

    (void)sdio_host_set_high_speed();
    (void)sdio_host_set_bus_4bit();
    (void)sdio_host_set_run_clock();
    return CY_RSLT_SUCCESS;
}

/* WHD issues only CMD52 (IO_RW_DIRECT) here; CMD0/3/5/7 happened in init. The
 * argument is the standard SDIO CMD52 layout: func[30:28], addr[25:9], data[7:0].
 * The response carries the R5 data byte. */
cy_rslt_t cyhal_sdio_send_cmd(const cyhal_sdio_t *obj, cyhal_transfer_t direction,
                              cyhal_sdio_command_t command, uint32_t argument, uint32_t *response)
{
    uint8_t function = (uint8_t)((argument >> 28) & 0x07U);
    uint32_t address = (argument >> 9) & 0x1FFFFU;
    uint8_t io = (uint8_t)(argument & 0xFFU);
    bool ok;

    (void)obj;

    if (NULL != response)
    {
        *response = 0UL;
    }

    /* CMD0/CMD3/CMD5/CMD7 are handled in cyhal_sdio_init(); ignore them here the
     * way the WHD bus driver expects. */
    if (CYHAL_SDIO_CMD_IO_RW_DIRECT != command)
    {
        return CY_RSLT_SUCCESS;
    }

    if (CYHAL_WRITE == direction)
    {
        uint8_t value = io;

        g_whd_sdio_cmd52_enter_count++;
        g_whd_sdio_cmd52_last_write = 1U;
        g_whd_sdio_cmd52_last_function = function;
        g_whd_sdio_cmd52_last_address = address;
        g_whd_sdio_cmd52_last_io = io;
        (void)sdio_begin_bus_blocking();
        ok = sdio_host_cmd52_write(function, address, value, &io);
        sdio_end_bus();
        sdio_sdhi_irq_rearm_after_bus();
        g_whd_sdio_cmd52_last_io = io;
        g_whd_sdio_cmd52_last_ok = ok ? 1U : 0U;
        g_whd_sdio_cmd52_exit_count++;
        if (ok)
        {
            /* Keep the host block-size cache in sync with the per-function
             * block-size registers WHD programs here (notably F2), so block-mode
             * CMD53 on those functions is not rejected for a zero cached size. */
            sdio_host_note_cmd52_write(function, address, value);
        }
    }
    else
    {
        g_whd_sdio_cmd52_enter_count++;
        g_whd_sdio_cmd52_last_write = 0U;
        g_whd_sdio_cmd52_last_function = function;
        g_whd_sdio_cmd52_last_address = address;
        g_whd_sdio_cmd52_last_io = io;
        (void)sdio_begin_bus_blocking();
        ok = sdio_host_cmd52_read(function, address, &io);
        sdio_end_bus();
        sdio_sdhi_irq_rearm_after_bus();
        g_whd_sdio_cmd52_last_io = io;
        g_whd_sdio_cmd52_last_ok = ok ? 1U : 0U;
        g_whd_sdio_cmd52_exit_count++;
    }

    sdio_debug_trace(SDIO_DEBUG_TRACE_CMD52, (CYHAL_WRITE == direction) ? 1U : 0U,
                     function, address, (uint32_t)(argument & 0xFFU),
                     (uint32_t)io, (uint32_t)io, ok ? CY_RSLT_SUCCESS :
                     CYHAL_SDIO_RSLT_ERR_FUNC_RET(CYHAL_SDIO_RET_CMD_TIMEOUT), 0U);

    if (NULL != response)
    {
        *response = (uint32_t)io;
    }
    if (!ok)
    {
        sdio_log_cmd52_fail((CYHAL_WRITE == direction), function, address, io, (uint32_t)io);
    }
    return ok ? CY_RSLT_SUCCESS : CYHAL_SDIO_RSLT_ERR_FUNC_RET(CYHAL_SDIO_RET_CMD_TIMEOUT);
}

/* CMD53 bulk transfer. Decode the SDIO CMD53 argument and dispatch to the raw
 * CMD53 host. WHD programs the Broadcom backplane window (SBADDR*) via CMD52
 * beforehand, so this issues the CMD53 verbatim. Byte-mode count 0 means 512. */
cy_rslt_t cyhal_sdio_bulk_transfer(cyhal_sdio_t *obj, cyhal_transfer_t direction, uint32_t argument,
                                   const uint32_t *data, uint16_t length, uint32_t *response)
{
    bool write = (CYHAL_WRITE == direction);
    uint8_t function = (uint8_t)((argument >> 28) & 0x07U);
    uint32_t address = (argument >> 9) & 0x1FFFFU;
    bool block_mode = (0U != ((argument >> 27) & 0x01U));
    bool increment = (0U != ((argument >> 26) & 0x01U));
    uint32_t count = argument & 0x1FFU; /* bytes (byte mode) or blocks (block mode) */
    uint32_t wait_count;
    uint32_t r5 = 0U;
    uint32_t data0 = 0U;
    uint32_t result = 0U;
    bool ok;

    (void)obj;
    (void)length;

    if (NULL != response)
    {
        *response = 0UL;
    }

    if ((!block_mode) && (0U == count))
    {
        count = 512U; /* byte-mode count field of 0 means 512 bytes */
    }

    g_whd_sdio_cmd53_enter_count++;
    g_whd_sdio_cmd53_last_write = write ? 1U : 0U;
    g_whd_sdio_cmd53_last_function = function;
    g_whd_sdio_cmd53_last_address = address;
    g_whd_sdio_cmd53_last_increment = increment ? 1U : 0U;
    g_whd_sdio_cmd53_last_block_mode = block_mode ? 1U : 0U;
    g_whd_sdio_cmd53_last_count = count;
    g_whd_sdio_cmd53_last_length = length;
    g_whd_sdio_cmd53_last_data_ptr = (uint32_t)(uintptr_t)data;
    g_whd_sdio_cmd53_last_result = 0U;
    g_whd_sdio_cmd53_last_data0 = 0U;
    if (2U == function)
    {
        sdio_diag_cmd53_f2_enter(write, address, increment, block_mode, count, length);
    }

    wait_count = sdio_begin_bus_blocking();
    g_whd_sdio_cmd53_last_wait_count = wait_count;
    if (!sdio_prepare_pre_cmd53(function))
    {
        sdio_end_bus();
        sdio_sdhi_irq_rearm_after_bus();
        g_whd_sdio_cmd53_last_ok = 0U;
        result = CYHAL_SDIO_RSLT_ERR_FUNC_RET(CYHAL_SDIO_RET_CMD_TIMEOUT);
        g_whd_sdio_cmd53_last_result = result;
        g_whd_sdio_cmd53_exit_count++;
        if (2U == function)
        {
            sdio_diag_cmd53_f2_exit(write, false, block_mode, count, length, 0U, result, 0U);
        }
        sdio_debug_trace(SDIO_DEBUG_TRACE_CMD53, write ? 1U : 0U, function, address,
                         count, length, 0U, g_whd_sdio_cmd53_last_result, 0U);
        return CYHAL_SDIO_RSLT_ERR_FUNC_RET(CYHAL_SDIO_RET_CMD_TIMEOUT);
    }

    ok = sdio_host_cmd53(write, function, address, increment, block_mode,
                         (uint8_t *)data, count, &r5);
    data0 = sdio_debug_data0(data, length);
    sdio_end_bus();
    sdio_sdhi_irq_rearm_after_bus();

    if (NULL != response)
    {
        *response = r5;
    }
    g_whd_sdio_cmd53_last_r5 = r5;
    g_whd_sdio_cmd53_last_ok = ok ? 1U : 0U;
    result = ok ? CY_RSLT_SUCCESS : CYHAL_SDIO_RSLT_ERR_FUNC_RET(CYHAL_SDIO_RET_DAT_TIMEOUT);
    g_whd_sdio_cmd53_last_result = result;
    g_whd_sdio_cmd53_last_data0 = data0;
    g_whd_sdio_cmd53_exit_count++;
    if (2U == function)
    {
        sdio_diag_cmd53_f2_exit(write, ok, block_mode, count, length, r5, result, data0);
    }
    sdio_debug_trace(SDIO_DEBUG_TRACE_CMD53, write ? 1U : 0U, function, address,
                     count, length, r5, g_whd_sdio_cmd53_last_result, data0);
    if (!ok)
    {
        g_whd_sdio_trace_frozen = 1U;
        sdio_log_cmd53_fail(write, function, address, increment, block_mode, count, r5);
        whd_sdio_debug_break_hook(0x53000000UL | ((write ? 1UL : 0UL) << 16) | (uint32_t)function);
    }
    return ok ? CY_RSLT_SUCCESS : CYHAL_SDIO_RSLT_ERR_FUNC_RET(CYHAL_SDIO_RET_DAT_TIMEOUT);
}

/* No DMA/async engine on this polled host: run the transfer synchronously. */
cy_rslt_t cyhal_sdio_transfer_async(cyhal_sdio_t *obj, cyhal_transfer_t direction, uint32_t argument,
                                    const uint32_t *data, uint16_t length)
{
    return cyhal_sdio_bulk_transfer(obj, direction, argument, data, length, NULL);
}

bool cyhal_sdio_is_busy(const cyhal_sdio_t *obj)
{
    (void)obj;
    return false; /* synchronous host: never busy on return */
}

cy_rslt_t cyhal_sdio_abort_async(const cyhal_sdio_t *obj)
{
    (void)obj;
    return CY_RSLT_SUCCESS;
}

/* Store WHD's in-band card-interrupt callback. By default CYHAL_SDIO_CARD_INTERRUPT
 * is driven from SDHI SDACI; the software timer path remains only as an optional
 * fallback for low-level isolation. */
void cyhal_sdio_register_irq(cyhal_sdio_t *obj, cyhal_sdio_irq_handler_t handler, void *handler_arg)
{
    (void)obj;

    g_sdio_irq_handler = handler;
    g_sdio_irq_handler_arg = handler_arg;
}

void cyhal_sdio_irq_enable(cyhal_sdio_t *obj, cyhal_sdio_irq_event_t event, bool enable)
{
    (void)obj;

    if (CYHAL_SDIO_CARD_INTERRUPT == event)
    {
#if WHD_SDIO_USE_SDHI_IRQ
        sdio_softirq_enable(false);
        sdio_sdhi_irq_enable(enable);
#else
        sdio_softirq_enable(enable);
#endif
    }
}
